app/Controllers/SuperAdmin/OrderController.php

SELECT *
FROM `tb_order`
WHERE `status` = 'done'
---
    public function completed()
    {
        $data = [
            'title' => 'Pengajuan Selesai',
            'orders' => $this->orderModel->where('status', 'done')->findAll()