app/Controllers/SuperAdmin/UserController.php

SELECT *
FROM `users`
---
    public function index()
    {
        $users = $this->userModel->findAll();  // Ambil semua data user

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function edit($id)
    {
        $user = $this->userModel->find($id);  // Ambil data user berdasarkan ID